/* 
  Alerts.strings
  CleanMyMac

  Created by Vera Tkachenko on 2/22/15.
  Copyright (c) 2015 MacPaw. All rights reserved.
*/
/* Buttons */

"AlertButton_Continue" = "Continua";
"AlertButton_BuyLicense" = "Acquista una licenza";
"AlertButton_BuyLicenseWithDiscount" = "Acquista con uno sconto del %li%%";
"AlertButtonTitle_Erase" = "Cancella";

/* App Termination */
"AlertButton_ContinueScan" = "Riprendi la scansione";
"AlertButton_ContinueClean" = "Riprendi la pulizia";
"AlertButton_QuitCompleteTasks" = "Completa tutto e chiudi";
"AlertButton_QuitForce" = "Uscita forzata";
"AlertButton_CheckForBeta" = "Cercare aggiornamenti Beta";
"Stop" = "Interrompi";

"AlertButtonTitle_Uninstall" = "Disinstalla";
"AlertButtonTitle_DontUninstall" = "Non disinstallare";

"AlertButtonTitle_Reset" = "Ripristina";

/* Running not from Apps folder */
"AlertButtonTitle_Install" = "Installa";
"AlertButtonTitle_DontInstall" = "Non installare";
"AlertButtonTitle_Overwrite" = "Sovrascrivi";
"AlertButtonTitle_DontOverWrite" = "Non sovrascrivere";


/* Beta Updates Alert */
"AlertDescription_BetaUpdateEnabling" = "Le versioni Beta ti offrono alcune funzioni prima che siano introdotte ufficialmente. Considera che le versioni Beta di CleanMyMac possono essere instabili o provocare la perdita di dati. Il loro uso è a rischio e pericolo dell'utente. MacPaw NON fornisce supporto tecnico per le versioni Beta e non è responsabile di danni causati da queste versioni.\n\nGli utenti delle versioni Beta possono aiutarci a migliorare il nostro software inviandoci feedback tramite il menu \"Invia feedback\".";

"AlertTitle_BetaUpdateEnabling" = "Installare le versioni beta di CleanMyMac?";

/* Reset Ignore List Alert */
"AlertDescription_ResetIgnoreList" = "Ciò consentirà a CleanMyMac di eseguire la scansione e rimuovere gli elementi precedentemente aggiunti alla Lista Ignora.";

"AlertTitle_ResetIgnoreList" = "Ripristinare la lista degli elementi da ignorare alle impostazioni di default?";

/* Activation */
"AlertTitle_CleaningWithinLimitAlert" = "La copia corrente di CleanMyMac non è registrata.";

"AlertDescription_CleaningWithinLimitAlert" = "Ti restano %@ da pulire in questa versione demo di CleanMyMac 3. La versione attivata non ha nessun limite e permette di godere di tutti i vantaggi di un utente registrato di CleanMyMac 3.";

/* Uninstalling CMM */
"AlertDescription_UninstallingCMM" = "Finora hai usato CleanMyMac. Se clicchi sul pulsante Disinstalla essa verrà chiusa e completamente rimossa. Vuoi disinstallare CleanMyMac?";

"AlertTitle_UninstallingCMM" = "Disinstallazione di CleanMyMac";

/* Reseting CMM */
"AlertDescription_ResetCMM" = "Riapri l'applicazione prima di continuare a usarla.";
"AlertTitle_ResetCMM" = "Hai appena ripristinato i file delle preferenze di CleanMyMac. Riapri CleanMyMac in modo che funzioni correttamente.";
"AlertButton_ConfirmSelfRestart" = "Riapri";
"AlertButton_CancelSelfRestart" = "Annulla";

/* Uninstalling Setapp */

"AlertTitle_UninstallingSetappMessage" = "Hai selezionato Setapp e %li delle sue applicazioni per la disinstallazione completa. Sei sicuro di voler eliminare Setapp e le applicazioni relative?";
"AlertDescription_UninstallingSetappMessage" = "Nota che questo servizio ti offre una quantità crescente di applicazioni a cui puoi accedere solo tramite l'applicazione principale Setapp.";
"AlertButton_SelectSetappApplications" = "Seleziona applicazioni Setapp";
"AlertCheckboxText_UninstallingSetappMessage" = "Non mostrare più questo messaggio";

/* Drop iPhoto alert */
"AlertDescription_DropiPhotoWhileScanning" = "L'avvio della nuova scansione eliminerà i risultati della scansione attuale.";

"AlertTitle_DropiPhotoWhileScanning" = "Scansiona un'altra libreria.";

/* Logging mode alert */
"AlertTitle_LoggingMode" = "Attivazione della registrazione estesa.";

"AlertDescription_LoggingMode" = "CleanMyMac manterrà un registro esteso di tutti gli oggetti trovati durante la scansione. Con la registrazione estesa attivata, il nostro servizio di assistenza tecnica sarà in grado di aiutare a risolvere possibili problemi segnalati in maniera più precisa e veloce.";

/* Need To Close Applications Alert */
"AlertDescription_GenericAuth" = "CleanMyMac richiede l'autorizzazione per apportare le modifiche richieste.";

/* Extensions Authorize Alert */
"AlertDescription_ExtensionsAuthFormat" = "Autorizza CleanMyMac a %@ questa estensione ed eseguire altre operazioni che richiedono diritti di amministratore.";

"ExtensionsAuthAlert_EnableAction" = "abilita";

"ExtensionsAuthAlert_DisableAction" = "disabilitare";

/* CMM force quit alert */
"AlertTitle_ForceQuit" = "Non è stato possibile chiudere normalmente CleanMyMac durante l'ultimo tentativo d'uscita.";

"AlertDescription_ForceQuit" = "Alcuni processi relativi alla pulizia sono ancora in corso e, se interrotti, potrebbero causare la perdita di dati o un comportamento anomalo del sistema. Consigliamo di completare tutti i processi prima di uscire dall'applicazione.";

/* CMM running not from Apps folder alerts */
"AlertMessageText_RunningNotFromAppFolder" = "CleanMyMac non è attualmente in esecuzione dalla cartella Applicazioni.";

"AlertInformativeText_WishInstallQuestion" = "Installare CleanMyMac nella cartella Applicazioni prima di uscire?";

"AlertTitle_AlreadyInstalled" = "CleanMyMac è già installato sul sistema!";

"AlertTitle_OverwriteQuestion" = "Sovrascrivere CleanMyMac nella cartella Applicazioni?";

"AlertTitle_InstallationFailder" = "Installazione di CleanMyMac non riuscita!";

"AlertTitle_CopyToApplicationFolderSuggestion" = "Consigliamo di copiare manualmente l'applicazione nella posizione desiderata. La posizione consigliata è la cartella Applicazioni.";

/* Selection Alert LargeOldFiles */
"SelectionCautionAlertTitle_LargeOld" = "Hai selezionato diversi file personali per la rimozione completa.";

"SelectionCautionAlertMessage_LargeOld" = "Considera che il modulo Grandi e vecchi file non suggerisce gli elementi che possono essere rimossi in modo sicuro. Ti preghiamo di tenerne conto e di procedere con cautela quando decidi di rimuovere un file.";

/* Selection Alert Uninstaller */
"SelectionCautionAlertTitle_Uninstaller" = "Hai selezionato diverse applicazioni per la disinstallazione.";

"SelectionCautionAlertMessage_Uninstaller" = "Considera che il modulo Disinstallazione è progettato per disinstallare le applicazioni e che utilizzando il pulsante Disinstalla le applicazioni selezionate saranno rimosse completamente.";

/* Remove Alerts LargeOldFiles */
"RemoveAlertMessageText_LargeOld1File" = "Rimuovere definitivamente \"%@\"?";

"RemoveAlertMessageText_LargeOldXFiles" = "Rimuovere definitivamente %@?";

"RemoveAlertInformativeText_LargeOldFilesGroupScanner" = "Non è possibile annullare questa azione.";

/* Remove Alerts Uninstaller */
"RemoveAlertMessageText_Uninstaller1App" = "Disinstallare definitivamente \"%@\" e tutti i suoi elementi correlati?";

"RemoveAlertMessageText_UninstallerXApps" = "Disinstallare definitivamente %@ e tutti i suoi elementi correlati?";

"RemoveAlertMessageText_Uninstaller1File" = "Rimuovere definitivamente \"%@\"?";

"RemoveAlertMessageText_UninstallerRelatedFiles" = "Rimuovere definitivamente %@?";

"RemoveAlertMessageText_UninstallerResetApp" = "Ripristinare definitivamente \"%@\" rimuovendo tutti i suoi elementi correlati?";

"RemoveAlertMessageText_UninstallerSelectedItems" = "Rimuovere definitivamente tutti gli elementi selezionati?";

"RemoveAlertInformativeText_Uninstaller" = "Non è possibile annullare questa azione.";

/* Remove Alerts Extensions */
"RemoveAlertMessageText_Extensions1Item" = "Rimuovere definitivamente \"%@\"?";

"RemoveAlertMessageText_ExtensionsXItems" = "Rimuovere definitivamente %@?";

"RemoveAlertInformativeText_ExtensionsGroupScanner" = "Non è possibile annullare questa azione.";

/* Remove Alerts Eraser */
"RemoveAlertMessageText_Eraser1Item" = "Eliminare definitivamente \"%@\"?";

"RemoveAlertMessageText_EraserXItems" = "Eliminare definitivamente %@?";

"RemoveAlertInformativeText_EraserGroupScanner" = "Non è possibile annullare questa azione.";

/* Ignored Items alerts */
"AlertTitle_1_IgnoredItemsDidAdd" = "Hai aggiunto un elemento alla Lista Ignora di CleanMyMac.";

"AlertTitle_N_IgnoredItemsDidAddFormat" = "Hai aggiunto %@ alla Lista Ignora di CleanMyMac.";

"AlertDescription_1_IgnoredItemsDidAdd" = "Questo elemento non verrà più visualizzato tra i risultati della scansione. Puoi gestire gli elementi ignorati in Impostazioni.";

"AlertDescription_N_IgnoredItemsDidAdd" = "Questi elementi non verranno più visualizzati tra i risultati della scansione. Puoi gestire gli elementi ignorati in Impostazioni.";

"AlertTitle_ShouldSelectIgnoredItem" = "Selezionare l'elemento dalla Lista Ignora per la rimozione?";

"AlertDescription_ShouldSelectIgnoredItem" = "La rimozione di tali elementi potrebbe avere effetto sul funzionamento del sistema e delle applicazioni relative.";

/* No comment provided by engineer. */
"AlertTitle_StopCleanWarning" = "Interrompere il processo di pulizia prima che venga completato?";

/* No comment provided by engineer. */
"AlertTitle_StopScanWarning" = "Interrompere il processo della scansione prima che venga completato?";

/* No comment provided by engineer. */
"AlertDecription_StopCleanWarning" = "L'interruzione della pulizia lascerà una certa quantità di oggetti inutili sul tuo Mac.";

/* No comment provided by engineer. */
"AlertTitle_StartOver" = "Vuoi azzerare le statistiche di utilizzo e farle ripartire?";

/* No comment provided by engineer. */
"AlertDecription_StartOver" = "I risultati della scansione attuale non saranno salvati. Per localizzare gli elementi dovrai eseguire una nuova scansione.";

/* No comment provided by engineer. */
"AlertTitle_Rescan" = "Vuoi ripristinare i risultati attuali dell'analisi e riavviare una nuova scansione?";

/* No comment provided by engineer. */
"AlertDescription_Rescan" = "I risultati attuali di scansione e la lista degli elementi selezionati non verranno salvati.";

/* No comment provided by engineer. */
"AlertTitle_Refresh" = "Vuoi aggiornare l'attuale lista %@?";

/* No comment provided by engineer. */
"AlertDescription_Refresh" = "L'attuale selezione di elementi non verrà salvata.";

/* No comment provided by engineer. */
"AlertDescription_StopScanWarning" = "L'interruzione della scansione darà risultati incompleti per la pulizia.";

/* No comment provided by engineer. */
"AlertTitle_UnableToEnablePlugin" = "Impossibile attivare/disattivare il plugin.";

/* No comment provided by engineer. */
"AlertDescription_UnknownError" = "Errore sconosciuto. Contatta il servizio di assistenza.";

/* Maintenance verify disk */
"AlertTitle_VerifySystemDiskWarn" = "Durante la verifica del disco di avvio il tuo computer potrebbe non rispondere.";
"AlertDescription_VerifySystemDiskWarn" = "A causa dell'elevata attività del disco durante la verifica, è possibile che il tuo computer non risponda. Consideralo un comportamento normale.";

/* Alerts */
"AlertDescription_QuitOnScan" = "L'uscita dall'applicazione interromperà la scansione e tutti i risultati andranno persi.";

/* Alerts */
"AlertDescription_QuitOnClean" = "L'uscita dall'applicazione interromperà la pulizia e causerà risultati di pulizia incompleti.";

/* Alerts */
"AlertTitle_QuitOnScan" = "Uscire da CleanMyMac prima della conclusione della scansione corrente?";

/* Alerts */
"AlertTitle_QuitOnClean" = "Uscire da CleanMyMac prima della conclusione della pulizia?";

/* System Restart */
"CleanMyMac has just uninstalled %@ malware. A restart of your Mac is required to finish the process." = "CleanMyMac ha appena disinstallato %@ malware. Per completare il processo è necessario riavviare il Mac.";
"Please note that some applications may work incorrectly until your system is restarted." = "Considera che prima del riavvio del sistema il funzionamento di alcune applicazioni potrebbe essere anomalo.";


/* Self Uninstall Discount */
"SelfUninstallDiscount_AlertTitle" = "A volte possiamo fare un'eccezione.";
"SelfUninstallDiscount_AlertDescription" = "E questa lo è. Solo oggi, siamo felici di offrirti lo sconto del %li%% sulla versione completa di CleanMyMac 3.";

/* Self uninstall alert */
"SelfUninstall_AlertDescription" = "Aiutaci a migliorare CleanMyMac specificando perché vuoi disinstallare l'applicazione:";
"SelfUninstall_AlertTitle" = "Ci dispiace che tu ci abbandoni!";
"Submit and Uninstall" = "Invia e disinstalla";

"The price is a bit too much." = "Il prezzo è un po' alto.";
"It's too hard to use. I had trouble figuring it out." = "È troppo difficile da usare. Ho avuto difficoltà a imparare come si usa.";
"It didn't find enough to clean!" = "Non ha trovato sufficienti elementi da pulire!";
"It doesn't seem safe to use." = "Non mi sembra sicuro.";
"Other:" = "Altro:";

"IgnoreList_AlertTitle_AddedMacTrashToIgnoreList" = "Aggiungere il Cestino del disco di avvio alla Lista Ignora?";

"IgnoreList_AlertDescription_AddedMacTrashToIgnoreList" = "Ciò disattiverà la funzione di monitoraggio del Cestino e CleanMyMac 3 smetterà di inviare notifiche quando il Cestino si riempie.";

"IgnoreList_AlertTitle_EnableTrashMonitor" = "Attivare la funzione di monitoraggio del Cestino?";

"IgnoreList_AlertDescription_EnableTrashMonitor" = "Ciò rimuoverà il Cestino del disco di avvio dalla Lista Ignora di CleanMyMac.";

"AlertTitle_VerifySystemDiskWarn" = "Durante la verifica del disco di avvio il tuo computer potrebbe non rispondere.";

"AlertDescription_VerifySystemDiskWarn" = "A causa dell'elevata attività del disco durante la verifica, è possibile che il tuo computer non risponda. Consideralo un comportamento normale.";

"UnsupportedOSAlert_Message" = "Questa copia di CleanMyMac non supporta macOS %@ e le sue versioni future.";

"UnsupportedOSAlert_Informative" = "Consigliamo di eseguire l'aggiornamento all'ultima versione di CleanMyMac, che è completamente compatibile con la tua versione di macOS.";

/* Erase System Files Alert */
"EraseSystemFilesAlert_MessageText" = "Alcuni elementi selezionati non possono essere aggiunti allo strumento Cancellazione sicura.";

"EraseSystemFilesAlert_InformativeText" = "La rimozione di questi file o cartelle potrebbe danneggiare il sistema.";

"IgnoreList_AlertTitle_AddedMacTrashToIgnoreList" = "Aggiungere il Cestino del disco di avvio alla Lista Ignora?";
"IgnoreList_AlertDescription_AddedMacTrashToIgnoreList" = "Ciò disattiverà la funzione di monitoraggio del Cestino e CleanMyMac 3 smetterà di inviare notifiche quando il Cestino si riempie.";

"IgnoreList_AlertTitle_EnableTrashMonitor" = "Attivare la funzione di monitoraggio del Cestino?";
"IgnoreList_AlertDescription_EnableTrashMonitor" = "Ciò rimuoverà il Cestino del disco di avvio dalla Lista Ignora di CleanMyMac.";

/* Self Uninstall Discount */
"SelfUninstallDiscount_Uninstall" = "Disinstalla";
"SelfUninstallDiscount_Purchase" = "Acquista con il %li%% di sconto";

/* Buttons */
"Quit" = "Esci";

"Verify System Disk" = "Verifica disco di sistema";
"Download" = "Scarica";

"Submit" = "Invia";

"Restart" = "Riavvia";

/* Alert button */
"Cancel" = "Annulla";
"OK" = "OK";
"Remove" = "Rimuovi";

"Start New Scan" = "Avvia una nuova scansione";

/* Drop Trashes alert */
"AlertTitle_DropWhileScanning_TrashesGroupScanner" = "Scansiona un'altra libreria.";
"AlertDescription_DropWhileScanning_TrashesGroupScanner" = "L'avvio della nuova scansione eliminerà i risultati della scansione attuale.";

/* Drop LAOF alert */
"AlertTitle_DropWhileScanning_LargeOldFilesGroupScanner" = "Scansiona un'altra cartella.";
"AlertDescription_DropWhileScanning_LargeOldFilesGroupScanner" = "L'avvio della nuova scansione eliminerà i risultati della scansione attuale.";
"AlertTitle_MoveToAlbumInPhotos_LargeOldFilesGroupScanner" = "Gli elementi grandi e vecchi della libreria Foto verranno raccolti nell'album \"Grandi file multimediali da eliminare\" di Foto.";
"AlertDescription_MoveToAlbumInPhotos_LargeOldFilesGroupScanner" = "Elimina in modo permanente gli elementi utilizzando Foto per risparmiare spazio.";

/* Drop iPhoto alert */
"AlertDescription_DropWhileScanning_iPhotoGroupScanner" = "L'avvio della nuova scansione eliminerà i risultati della scansione attuale.";
"AlertTitle_DropWhileScanning_iPhotoGroupScanner" = "Scansiona un'altra libreria.";

/* Unsupported Photos Library version */
"AlertTitle_PhotoLibraryUnsupportedOld" = "La libreria di cui stai tentando di effettuare la scansione non è supportata da CleanMyMac 3.";
"AlertDescription_PhotoLibraryUnsupportedOld" = "Consigliamo di aggiornare la tua libreria foto a una versione più recente.";
"AlertTitle_PhotoLibraryUnsupportedNew" = "La libreria di cui stai tentando di effettuare la scansione non è supportata da CleanMyMac 3.";
"AlertDescription_PhotoLibraryUnsupportedNew" = "La compatibilità della versione della tua libreria foto è attualmente in fase di test. Riprova più tardi.";

/* Activation - Deactivate License Alert */
"ActivationDeactivateLicense_MessageText" = "Sei sicuro di voler disattivare la tua licenza CleanMyMac 3 su questo Mac?";
"ActivationDeactivateLicense_InformativeText" = "Ciò disattiverà la copia attuale dell'applicazione, ma potrai riutilizzare la tua licenza su un altro computer.";
"Disable License" = "Disabilita licenza";

/* Move to Setapp alert */
"AlertMoveToSetapp_Message" = "Sembra che tu stia usando Setapp sul tuo Mac. Vuoi passare alla versione Setapp di CleanMyMac?";
"AlertMoveToSetapp_Informative" = "Funziona allo stesso modo ed è sempre aggiornata con le \n versioni più recenti.";
"AlertMoveToSetapp_Switch" = "Cambia";
"AlertMoveToSetapp_DontSwitch" = "No, grazie";

/* switch to Setapp version of CMM*/
"AlertSwitchToSetappVersionOfCMM_Message" = "In precedenza hai usato una versione di CleanMyMac che non è Setapp.";
"AlertSwitchToSetappVersionOfCMM_InformationText" = "Vuoi passare alla versione Setapp e migrare le tue impostazioni precedenti?";
"AlertSwitchToSetappVersionOfCMM_Switch" = "Cambia";
"AlertSwitchToSetappVersionOfCMM_No_Thanks" = "No, grazie";
